# 01. Importing libs and files

In [1]:
# importing libs
import pandas as pd
import numpy as pp
import os

In [15]:
# defining path
path = r'C:\Users\hiron\Documents\050924_Instakart Basket analysis'

In [17]:
# importing files to dataframes
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'), index_col = False)
df_ords_orig = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

# 02. Basic operations and exploration

In [21]:
df_ords.head()

,Unnamed: 0,order_id,user_id,number_of_orders,weekday,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [9]:
df_ords = df_ords.drop(df_ords.columns[0], axis=1)

In [10]:
df_ords.head()

,order_id,user_id,number_of_orders,weekday,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [19]:
df_ords.shape

(3421083, 7)

In [20]:
df_ords_prior.shape

(32434489, 4)

# 03. Main operations on data

In [22]:
# Merging the unequal dataframes - take note the merge column is using inner join - so it willl be both
# to actually see how many merged - use how = Ã³uter' argument with merge
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [23]:
df_merged_large.head()

,Unnamed: 0,order_id,user_id,number_of_orders,weekday,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [24]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

# 04. Exporting desired data

In [25]:
# Export data to pkl

df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))